damBreak/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        nFaces          46;
        startFace       3938;
    }
    atmosphere
    {
        type            patch;
        nFaces          44;
        startFace       3984;
    }
    rightWall
    {
        type            wall;
        nFaces          46;
        startFace       4028;
    }
    lowerWall
    {
        type            wall;
        nFaces          52;
        startFace       4074;
    }
    defaultFaces
    {
        type            empty;
        nFaces          4032;
        startFace       4126;
    }
)

// ************************************************************************* //
